<?php include('assets/inc/header.php') ?>
<div class="page_partnership">
  <div class="inner">
    <h2>
      <span>ABOUT</span>
      <span>私たちについて</span>
    </h2>
    <p>
      「WEBサイトをつくりたい」「リニューアルしたい」と思っていても、どう進めればいいのかわからない…<br>
      「もっと自分たちのことを知ってほしい、でも方法がわからない…」<br>
      そんなお悩みをお持ちの方も多いのではないでしょうか。
    </p>
    <p>
      私たちは、お客様のイメージや想いを丁寧に引き出し、完全オーダーメイドでWEBサイトをつくります。<br>
      テンプレートや使い回しのデザインは一切使わず、お客様だけのオリジナルなデザインと設計をご提供します。
    </p>
    <p>

      WEBサイトの構成や導線設計、伝えたいことの整理整頓に時間をかけ、シンプルなサイトでもしっかりと伝わる構造を重視します。<br>
      「どのようなページ構成にするか」「どんな導線にするか」「何を伝えたいか」──こうした根本的な部分を大切に考え、機能としてのデザインを追求しています。<br>
      見た目をゴテゴテと飾り立てるような、“いかにも作りました”というデザインではなく、使いやすさや成果に繋がる本質的なデザインを提供しています。
    </p>
    <p>
      また、私たちは「ディレクション・デザイン・開発・運用」すべてを内製化しており、外部委託に頼らない一貫した体制で対応しています。<br>
      カメラマンやイラストレーターなどはプロジェクトに応じて連携しますが、サイト制作の中心工程はすべて自社で行います。
    </p>
    <p>
      ITや制作に関する知識はお客様によって異なり、業務への理解や期待も一人ひとり違います。<br>
      私たちはお客様ごとに伝える内容やその粒度、頻度を工夫し、最適なコミュニケーションを大切にしています。<br>
      相手の不安や疑問を常に意識し、寄り添い、安心していただけるよう心がけています。
    </p>
  </div>
</div>
<?php include('assets/inc/footer.php') ?>