<h1>サーバーとドメイン費用について</h1>
<p>ブログやホームページの運営、メールアドレスの利用には、サーバーはもちろん、ドメインの利用料金も必要です。</p>
<p>「インターネット上の住所」とも言われるドメインは、新たに取得するときや、継続利用するときに費用がかかります。</p>
<p>ドメインを初めて利用する場合、「ドメイン利用にどんな費用がかかるの？」「どのぐらいかかるのかわからない」と不安になりますよね。</p>
<p>この記事では、ドメインの利用に必要な費用を、まとめて分かりやすく解説していきます。</p>
<p>さらに、ドメインがずっと無料で使えるお得な方法も紹介しているので、ぜひ参考にしてください！</p>
<h2>ドメインとは？</h2>
<p>ドメインの利用にかかる費用を説明するまえに、「ドメインとは何か」をおさらいしておきましょう。</p>
<p>ドメインとは、インターネット上での「住所」を表す文字列のこと。<br>多くはウェブサイトのURLやメールアドレスなどに利用されます。</p>
<h2>ウェブサイトに毎月かかる費用</h2>
<p></p>
<figure>
  <img src="/note/server_and_domain/img_1.png">
  <figcaption>2025年8月時点の料金</figcaption>
</figure>