<article>
    <div class="clm_l">
        <p>
            福岡県宗像市にある「デイサービス みあらか」様のパンフレットを制作いたしました。
            本パンフレットでは、施設の理念である「安心をつくり、安心をとどける。」というメッセージを軸に、サービス内容や1日の流れ、運動プログラム、施設の特徴などをわかりやすく整理・構成しています。
        </p>
        <p>
            また、利用者さまやご家族が親しみを持てるよう、イラストや写真を多用し、柔らかく温かみのあるデザインに仕上げました。高齢者の方にも読みやすい文字サイズやレイアウトにも配慮しています。
        </p>
        <p>
            表面には施設の基本情報やアクセスマップ、裏面にはサービス詳細や利用者の様子が伝わる写真を配置し、パンフレット1枚で施設の魅力がしっかりと伝わる構成となっています。
        </p>
    </div>
    <div class="clm_r">
        <img src="/works/paper_miaraka/img_1.png">
        <img src="/works/paper_miaraka/img_2.png">
    </div>
</article>